// خطيط و تصميم الشبكات

// مقرر من مقررات السنة الخامسة في قسم تكنولوجيا المعلومات فصل اول
//  ، محتوى المقرر كيفية محاكاة شبكة حاسوبية حقيقية على برنامج PACKET TRACER
//   يفيد هذا البرنامج بدراسة الشبكة و تقييمها و دراسة إمكانية إضافة التحسينات
//    عليها على الأرض الواقع ، و تشمل المحاكاة أدق التفاصيل لمكونات الشبكة من نوعية الاكبال و 
//    switches routers و البروتوكولات المستخدمة و الخدمات التي تقدمها الشبكة

// حوسبة تفرعية 22222
// مقرر من مقررات السنة الخامسة في قسم تكنولوجيا المعلومات فصل اول 
// ، يتناول المقرر كيفية توزع أو توازي المعالجة في الحاسوب بحيث أن

//  سرعة المعالجة التفرعية اسرع و أكثر كفاءة من المعالجة التسلسلية 
//  و التي هي موجودة في أغلب الحواسيب الشخصية ،
//  و يشرح المقرر كيفية حدوث المعالجة التفرعية و من طرقها pipeline و
//   التطرق الى التحديات و المخاطر التي تواجه هذه الطريقه

// شبكات ذكية 3 ___________
// مقرر من مقررات السنة الخامسة في قسم تكنولوجيا المعلومات فصل اول 
// ، حيث كان اقتراح مفهوم الشبكات الذكية في الشبكات الهاتفية العادية فأصبح تقديم الشبكة
//  لخدمات اخرى في خدمات المكالمات الصوتية و التبديل ضرورة ملحة، اي المفهوم الأساسي
//   للذكاء في الشبكات الهاتفية هو فصل منطق التبديل الأساسي عن منطق الخدمة و تناول هذا المقرر
//    شبكة AD Hoc التي عبارة عن مجموعة من عقد لاسلكية و لها انواع مثل MANET و VANET ... و دراسة
//     بروتوكولات التوجيه المستخدمة في كل نوع

// CPN 4444
// مقرر من مقررات السنة الخامسة في قسم تكنولوجيا المعلومات فصل اول 
// ، و هي اختصار لشبكات بتري الملونة حيث تستخدم الأحداث المتقطعة و
//  يقوم نموذج  CPN على الحالات places و الاحداث transition التي تسبب تغير حالة النظام
//   ، و يتم استخدام أداة البرمجة cpn tool لتحرير و محاكاة و تحليل فضاء الحالة ,  وتم
//    دراسة برتوكول simple المكون من مرسل يمرر حزمة من المعطيات إلى المستقبل و يكون الاتصال
//     فيه غير موثوق و يستخدم تقنية التوقف و الانتظار حيث يتم إعادة الارسال للمعطيات حتى الحصول على رسالة الاعتراف
//     ACK

// التنقيب في البيانات
// مقرر من مقررات السنة الخامسة في قسم تكنولوجيا المعلومات فصل اول 
// ، و تتناول تطبيق خوارزميات قادرة على التعامل مع الكم الهائل من البيانات
//  الموجودة حالياً في هذا العالم و اكتشاف المعرفة من هذه البيانات الضخمة 
//  و توظيف المعرفة المكتشفة في مجالات عدة مثل التنبؤ بالطقس و الكوارث الطبيعية
//   و غيرها، بمعنى آخر data mining هي انشاء نماذج للحصول على patterns المخفية في
//    مجموعات كبيرة و معقدة من البيانات